<h1> Pandas </h1>

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame(np.arange(0,30).reshape(6,5),index=["Row1", "Row2", "Row3", "Row4", "Row5", "Row6"],columns=["Column1", "Column2", "Column3", "Column4", "Column5"])

In [3]:
df.head()

      Column1  Column2  Column3  Column4  Column5
Row1        0        1        2        3        4
Row2        5        6        7        8        9
Row3       10       11       12       13       14
Row4       15       16       17       18       19
Row5       20       21       22       23       24

In [4]:
df.to_csv('Text1.csv')

In [5]:
df.loc["Row1"]

Column1    0
Column2    1
Column3    2
Column4    3
Column5    4
Name: Row1, dtype: int32

In [6]:
type(df.loc["Row1"])

pandas.core.series.Series

In [8]:
df.iloc[0:1, 0:1]

      Column1
Row1        0

In [9]:
df.iloc[0:2, 0:2]

      Column1  Column2
Row1        0        1
Row2        5        6

In [10]:
type(df.iloc[0:2, 0:2])

pandas.core.frame.DataFrame

In [11]:
df.iloc[0:2, 0:1]

      Column1
Row1        0
Row2        5

In [12]:
type(df.iloc[0:2, 0:2])

pandas.core.frame.DataFrame

In [13]:
df.iloc[0:1, 0:2]

      Column1  Column2
Row1        0        1

In [14]:
type(df.iloc[0:2, 0:2])

pandas.core.frame.DataFrame

In [15]:
df.iloc[0:1, 0:1]

      Column1
Row1        0

In [18]:
type(df.iloc[0:1, 0])

pandas.core.series.Series

In [19]:
df.iloc[0:1, 0]

Row1    0
Name: Column1, dtype: int32

In [20]:
df.iloc[:, :].values

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24],
       [25, 26, 27, 28, 29]])

In [21]:
df.isnull()

      Column1  Column2  Column3  Column4  Column5
Row1    False    False    False    False    False
Row2    False    False    False    False    False
Row3    False    False    False    False    False
Row4    False    False    False    False    False
Row5    False    False    False    False    False
Row6    False    False    False    False    False

In [5]:
df = pd.read_csv('Text1.csv', sep=';')

In [6]:
df.head()

  Unnamed: 0  Column1  Column2  Column3  Column4  Column5
0       Row1        0        1        2        3        4
1       Row2        5        6        7        8        9
2       Row3       10       11       12       13       14
3       Row4       15       16       17       18       19
4       Row5       20       21       22       23       24

<h2> CSV </h2>

In [7]:
from io import StringIO, BytesIO

In [9]:
data = ('col1, col2, col3\n'
        '1, 2, a\n'
        '3, 4, b\n'
        '5, 6, c\n')

In [10]:
pd.read_csv(StringIO(data))

   col1   col2  col3
0     1      2     a
1     3      4     b
2     5      6     c

In [14]:
df=pd.read_csv(StringIO(data))

In [15]:
df

   col1   col2  col3
0     1      2     a
1     3      4     b
2     5      6     c

In [16]:
df.to_csv('Test.csv')

In [18]:
df = pd.read_csv('Test.csv', usecols=[0, 2])

In [19]:
df

   Unnamed: 0   col2
0           0      2
1           1      4
2           2      6

In [20]:
df = pd.read_csv('Test.csv', usecols=[1, 3])

In [21]:
df

   col1  col3
0     1     a
1     3     b
2     5     c

In [22]:
data = ('a, b, c\n'
        '1, 2, 3\n'
        '4, 5, 6\n'
        '7, 8, 9\n')

In [23]:
data

'a, b, c\n1, 2, 3\n4, 5, 6\n7, 8, 9\n'

In [24]:
print(data)

a, b, c
1, 2, 3
4, 5, 6
7, 8, 9

In [25]:
df=pd.read_csv(StringIO(data), dtype='int')

In [26]:
df

   a   b   c
0  1   2   3
1  4   5   6
2  7   8   9

In [31]:
df['a'][2]

7

In [35]:
df=pd.read_csv(StringIO(data), dtype={'b':int, 'c':float})

In [36]:
df

   a   b   c
0  1   2   3
1  4   5   6
2  7   8   9

In [37]:
df.dtypes

a     int64
 b    int64
 c    int64
dtype: object

In [40]:
data=('index,a,b,c\n'
      '0,1,2,3\n'
      '4,5,6,7\n')

In [43]:
df=pd.read_csv(StringIO(data), index_col=1)

In [44]:
df

   index  b  c
a
1      0  2  3
5      4  6  7

In [46]:
pd.read_csv(StringIO(data))

   index  a  b  c
0      0  1  2  3
1      4  5  6  7

In [48]:
pd.read_csv(StringIO(data), index_col=False)

   index  a  b  c
0      0  1  2  3
1      4  5  6  7